# DataFrame part2

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [3]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [4]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [5]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [11]:
df=pd.DataFrame(np.random.randint(0,50,12).reshape(6,2),hier_index,['A','B'])

In [12]:
df

       A   B
G1 1  19  41
   2  19  38
   3  23  25
G2 1  11  18
   2   5  41
   3  40  15

In [13]:
df.loc['G1']

    A   B
1  19  41
2  19  38
3  23  25

In [14]:
df.loc['G1'].loc[1]

A    19
B    41
Name: 1, dtype: int32

In [15]:
df['A']

G1  1    19
    2    19
    3    23
G2  1    11
    2     5
    3    40
Name: A, dtype: int32

In [16]:
df.index.names

FrozenList([None, None])

In [19]:
df.index.names=['Groups','Numbers'] ##setting index

In [18]:
df

                 A   B
Groups Numbers
G1     1        19  41
       2        19  38
       3        23  25
G2     1        11  18
       2         5  41
       3        40  15

In [20]:
df.loc['G2'].loc[2]['B']

41

In [21]:
df.loc['G1'].loc[3]['A']

23

# cross-section of rows and column getting

In [22]:
df

                 A   B
Groups Numbers
G1     1        19  41
       2        19  38
       3        23  25
G2     1        11  18
       2         5  41
       3        40  15

In [23]:
df.loc['G1']

          A   B
Numbers
1        19  41
2        19  38
3        23  25

In [24]:
df.xs('G1')

          A   B
Numbers
1        19  41
2        19  38
3        23  25

# inoder to get all values of 1 from G1 AND G2

In [26]:
df.xs(1,level='Numbers') ##using crossection

         A   B
Groups
G1      19  41
G2      11  18